Repository: 84000/data-translation-memory
Catalog: Toh_157-The_Questions_of_the_Kimnara_King_Druma-v2.tmx
Source language: bo
Languages: en

source: ཡི་རངས་ཤིང་རབ་ཏུ་དགའ་ནས་དགའ་བ་དང་ཡིད་བདེ་བ་སྐྱེས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་ཕྱག་འཚལ་ནས་ཚུལ་དང་འཐུན་པའི་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་བཅོམ་ལྡན་འདས་ལ་མངོན་པར་བསྟོད་དོ། །
en: With joy and happiness filling their minds, they prostrated to the feet of the Blessed One and offered him these appropriate verses of praise:

source: དྲི་མེད་དྲི་བྲལ་དྲི་མ་གཅོད་མཛད་པ། །རྡུལ་མེད་རྡུལ་བྲལ་ལྷག་པའི་གཟི་བརྗིད་མངའ། །
en: “You are stainless and immaculate, you have eliminated all defilements, You are flawless and pure, you shine with great majesty,

source: པད་མའི་འདབ་འདྲའི་སྤྱན་དང་མཛེས་པའི་ཐུགས། །དྲི་མེད་ཟླ་ཞལ་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: Your eyes are like lotus petals, your mind is magnificent, And your face is radiant like the stainless moon; we prostrate to you!

source: དགའ་མཛད་ཞི་མཛད་ཉོན་མོངས་གཅོད་མཛད་པ། །དགའ་བ་སྟོན་པ་རྟག་ཏུ་དགོན་པར་དགྱེས། །
en: “You generate joy and peace, you have eliminated all afflictions, You manifest joy, you are always delighted by the wilderness,

source: རིན་ཆེན་འབྱུང་གནས་རིན་ཆེན་མཛོད་མངའ་བ། །ཡོན་ཏན་མཆོག་མངའ་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: You are a source of jewels, and you possess a precious treasure As well as the highest qualities; we prostrate to you!

source: ཕ་རོལ་གཤེགས་པ་གཞན་གྱི་ཚོགས་རྣམས་འཇོམས། །
en: “You have reached the other shore and conquered all enemies.

source: པད་མ་ལྟ་བུར་སྟོང་མཆོག་བཀའ་མཆིད་གསུང་། །
en: Like a lotus flower, you give a thousand supreme discourses.

source: ལམ་མཆོག་སྩོལ་ཅིང་དམ་པའི་དོན་སྟོན་པ། །མཆོག་ཏུ་དགའ་མཛད་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: You bestow the supreme path and reveal the sacred meaning; Provider of supreme joy, we prostrate to you!

source: ཆུ་བོ་བཞི་རྒལ་བདེན་བཞིའི་བཀའ་མཆིད་གསུང་། །
en: “You have crossed the four rivers, you proclaim the discourse on the four truths,

source: ས་ལ་རྒྱུ་བ་འདི་ལ་མིག་སྩོལ་བ། །འཁོར་ལོ་མཆོག་གི་མཚན་ནི་སྟོང་མངའ་བ། །རྡུལ་མེད་ཕན་མཛད་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: You confer vision on those who live on this earth, And you possess the mark of the supreme thousand-spoked wheel; Flawless benefactor, we prostrate to you!

source: ཉོན་མོངས་རྡུལ་བསལ་དམ་པ་མཐུ་བོ་ཆེ། །མགོན་པོ་འགྲོ་ལ་མཆོག་གི་དོན་མཛད་པ། །བདུད་ཀྱི་དཔུང་རྣམས་སྟོབས་མེད་འཇིག་མཛད་པ། །བཅོམ་ལྡན་སྟོབས་བཅུ་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: “Sublime Powerful One, you have cleared away the dirt of the afflictions. Protector, you provide supreme assistance to beings And you have destroyed the powerless armies of Māra; Blessed One endowed with the ten powers, we prostrate to you!

source: སྲེད་པའི་འཁྲི་ཤིང་གཅོད་མཛད་མཉམ་པ་མེད། །བརྙེས་པ་དག་དང་མ་བརྙེས་མཚུངས་མཉམ་ཐུགས། །འཇིག་རྟེན་མཐར་འབྱིན་སྣང་བའི་སྒྲོན་མཛད་པ། །རྒྱ་མཚོ་ལྟ་བུ་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: “Peerless One, you have severed the thicket of craving And your unbiased mind perceives gain and loss as equal. You are the shining lamp that brings an end to worldly existence; Ocean-like being, we prostrate to you!

source: དུལ་ཞིང་སྟོབས་བཅུ་ཆེན་པོ་དམ་པ་མངའ། །
en: “You are composed, you possess the ten great and sacred powers,

source: སྦྱིན་པ་སྩོལ་ཅིང་རྟག་ཏུ་གཏོང་ལ་དགྱེས། །
en: You practice generosity, and you always take pleasure in giving.

source: དུལ་བ་ཞི་གནས་ཡོན་ཏན་ཕ་རོལ་ཕྱིན། །ཉོན་མོངས་རྡུལ་བསལ་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: You have perfected the qualities of control and tranquility, And cleared away the dirt of the afflictions; we prostrate to you!

source: མཚན་མཆོག་འགྲོ་བ་ཀུན་ལ་དམ་པ་སྩོལ། །
en: “Possessor of the supreme marks, you confer the sacred Dharma upon all beings.

source: སྐྱེ་བོའི་འདྲེན་པ་ལྷ་ཡི་མཆོག་པས་མཆོག །བྱམས་དང་སྟོབས་དང་བཟོད་ལ་ངེས་པར་དགྱེས། །
en: Great leader of beings, most sublime god, You are truly delighted by love, the powers, and patience;

source: མཆོད་འོས་བདེ་གཤེགས་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: Blissful One worthy of praise, we prostrate to you!

source: མར་མེ་ལྟ་བུ་དྲི་མེད་ཟླ་བ་འདྲ། །ཕྱི་ནང་ཉོན་མོངས་དྲི་མ་གཅོད་མཛད་པ། །ཉོན་མོངས་སྤངས་པ་ཡོན་ཏན་བསོད་ནམས་གཏེར། །ཞི་བ་ཐུགས་ཞི་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: “Like a lamp or the stainless moon, You have eliminated the stains of outer and inner afflictions. You have abandoned all afflictions, you are a treasure of qualities and merit, And your mind is peaceful and tranquil; we prostrate to you!

source: དད་པ་སྩོལ་བ་དགེ་སྦྱོང་ཞི་མཛད་པ། །སྟོན་པ་སྐྱེ་མཆེད་དྲུག་ལས་ཐར་མཛད་པ། །རྗེས་སུ་དྲན་དྲུག་ཤིན་ཏུ་ཡོངས་དག་དྲན། །
en: “You induce faith and bring peace to spiritual practitioners. Great teacher, you liberate from the six sense sources, And your mindfulness of the six recollections is pure;

source: རྒྱལ་བ་དགེ་སྦྱོང་རྒྱལ་ལ་ཕྱག་འཚལ་ལོ། །
en: Victorious One, king of spiritual practitioners, we prostrate to you!

source: འདོམ་གང་འོད་ནི་གསེར་གྱི་ཁ་དོག་བལྟ། །
en: “Your aura of light has the color of gold, And

source: གསུང་སྙན་དམ་པ་རྣམ་པར་དག་པའི་དབྱངས། །བཅོམ་ལྡན་གང་ཟག་དམ་པ་སྐྱེས་བུ་མཆོག །སྲིད་གསུམ་ཞི་མཛད་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: your sacred, harmonious voice is pure. Blessed One, holy person, sublime being, Pacifier of the three realms, we prostrate to you!

source: ཤེས་རབ་མུན་པ་མ་མཆིས་ཕ་རོལ་གཤེགས། །
en: “You have reached the other shore through your unobscured insight.

source: རྟག་ཏུ་དཀའ་ཐུབ་བརྟུལ་ཞུགས་རབ་ཏུ་སྤྱོད། །
en: You always engage in austerities and disciplined conduct, And

source: དེ་བཞིན་ཁོ་ན་གཞན་མིན་དེ་བཞིན་གསུང་། །
en: your words always accord with the way things are;

source: མུན་པར་སྒྲོན་མ་འཛིན་ལ་ཕྱག་འཚལ་ལོ། །
en: Holder of the lamp that clears away darkness, we prostrate to you!

source: བདེ་གཤེགས་གྲགས་ལྡན་ཡོན་ཏན་བས་མ་འཚལ། །དེ་བཞིན་ཉིད་ཀྱི་ཆོས་ཀྱི་གནས་སྟོན་པ། །ཡོན་ཏན་བརྗོད་པ་མཐོང་ཞིང་གྲགས་བསྒྲགས་པས། །མཆོག་ཏུ་དགའ་མཛད་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: “Blissful One, Illustrious One with inexhaustible qualities, You reveal the abiding mode of suchness And your qualities are proclaimed, perceived, and renowned; Provider of supreme joy, we prostrate to you!

source: བསྔགས་ལ་གནས་ཤིང་བརྟུལ་ཞུགས་དཀའ་ཐུབ་འཕགས། །ཁེངས་དང་ང་རྒྱལ་རྒྱགས་པ་གཅོད་མཛད་པ། །ཡེ་ཤེས་འབྱུང་གནས་རྡུལ་བྲལ་བློ་གྲོས་མཆོག །སྐྱེ་བོ་མཐར་ཕྱིན་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: “You are praiseworthy, and your disciplined conduct and austerities are exalted, Yet you eliminate arrogance, pride, and haughtiness; Source of wisdom with immaculate supreme intelligence, Perfect being, we prostrate to you!

source: ཀ་ལ་བིང་ཀ་ཚངས་དབྱངས་ཐུགས་རྗེ་ཅན། །འདོད་པ་རྩོད་བགྱིད་དྲི་མ་སེལ་མཛད་པ། །ཕུང་པོ་ཡོངས་མཁྱེན་མཁས་པ་བདེ་བར་གཤེགས། །ཡོན་ཏན་ཚོགས་མཆོག་མངའ་ལ་ཕྱག་འཚལ་ལོ། །
en: “Compassionate One with the voice like Brahmā or the kalaviṅka bird, You clear away the stains of desire and dispute; Wise expert regarding the aggregates, Blissful One, Possessor of the highest qualities, we prostrate to you!

source: ཡོན་ཏན་སྟོན་པ་ཡོན་ཏན་བསྟོད་མཆོད་པ། །ཟབ་མོ་བལྟ་དཀའ་ཤིན་ཏུ་རྟོགས་པར་དཀའ། །འཛུམ་ཞལ་ཟླ་འདྲ་གསོང་པོར་གསུང་མཛད་པ། །བདུད་སྟོབས་འཇོམས་མཛད་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: “You display qualities that are praised and worshiped, Your smiling face is radiant like the moon, and you truthfully teach The profound, which is hard to perceive and extremely hard to realize; Subduer of Māra’s power, we prostrate to you!

source: མཉམ་ཐུགས་ཁ་ལོ་སྒྱུར་བ་རབ་དུལ་ཐུགས། །ཀུན་གྱིས་མངོན་བསྟོད་མཉམ་པའི་ལམ་ལ་གནས། །
en: “Great leader, your mind is composed and controlled, You are praised by everyone, and you dwell on the path of sameness.

source: ཐུབ་པ་མཆོག་གསུང་བདེན་པའི་བཀའ་མཆིད་ཅན། །བདེ་གཤེགས་མཉམ་ཐུགས་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: Lord with supreme and truthful speech, Blissful One with an unbiased mind, we prostrate to you!

source: ལམ་སྩོལ་སྙན་པ་ཤིན་ཏུ་འཇམ་པའི་དབྱངས། །བདུད་ཀྱི་སྡེ་མང་འཇོམས་མཛད་ང་རྒྱལ་དང་། །ལྷག་པའི་ང་རྒྱལ་མི་མངའ་ཚུལ་མི་འཆོས། །
en: “You reveal the path with your smooth and pleasant voice, You have defeated the many hordes of Māra, And you are free from pride, conceit, and hypocrisy;

source: ཐུབ་པ་དགེ་སྦྱོང་རྒྱལ་ལ་ཕྱག་འཚལ་ལོ། །
en: Lord, king of spiritual practitioners, we prostrate to you!

source: སྟོབས་དང་མཐུ་དང་བརྩོན་འགྲུས་བསམ་གཏན་དགྱེས། །
en: “You are delighted by the powers, strength, diligence, and concentration, And

source: རྟག་ཏུ་འདོད་ཆགས་སྐྱོན་དང་རབ་རིབ་བྲལ། །
en: you are permanently free from the defects of desire and obscured vision.

source: བདེ་བར་གཤེགས་པ་མི་གཡོ་གནས་ལ་ཞུགས། །
en: Blissful One, you have entered the immovable state;

source: སྟོབས་བཅུ་མཆོག་མངའ་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: Possessor of the ten supreme powers, we prostrate to you!

source: ཕྱག་དང་ཞབས་ནི་དྲི་མེད་དྲ་བས་འབྲེལ། །
en: “Your hands and feet are connected by immaculate webbing And

source: སྐྱེ་དང་རྒ་དང་འཆི་བ་མི་མངའ་བ། །རྒྱལ་བར་འོས་པ་འགྲོ་བ་ཀུན་ལས་རྒྱལ། །
en: you have transcended birth, old age, and death. Conqueror, you are victorious over all beings And

source: ནམ་མཁའ་མཉམ་ཐུགས་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: your mind is equal to the sky; we prostrate to you!”

source: དེ་ནས་མི་འམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོའི་སླས་མི་འམ་ཅིའི་བུ་མོ་བརྒྱད་ཁྲི་བཞི་སྟོང་པོ་དེ་དག་གིས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་གཏུགས་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་དེ་དག་གི་ལྷག་པའི་བསམ་པ་མཁྱེན་ནས་དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་འཛུམ་པ་མཛད་དོ། །
en: The eighty-four thousand queens of the kiṃnara king Druma then prostrated to the feet of the Blessed One, who saw their good motivation and smiled.

source: འདི་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་ཆོས་ཉིད་དེ་གང་གི་ཚེ་འཛུམ་པ་མཛད་པ་དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱི་ཞལ་གྱི་སྒོ་ནས་འོད་ཟེར་དུ་མ་ཁ་དོག་སྣ་ཚོགས་བྱུང་སྟེ། འདི་ལྟ་སྟེ། སྔོན་པོ་དང་། སེར་པོ་དང་། དམར་པོ་དང་། དཀར་པོ་དང་། ལེ་བརྒན་དང་། ཤེལ་དང་དངུལ་གྱི་ཁ་དོག་ལྟ་བུའོ། །
en: In accord with the nature of the blessed buddhas, when the Blessed One smiled, light rays radiated from his mouth in various colors—blue, yellow, red, white, violet, crystalline, and silver—and

source: དེ་དག་གིས་འཇིག་རྟེན་གྱི་ཁམས་མཐའ་ཡས་མུ་མེད་པར་འོད་ཀྱིས་ཁྱབ་པར་བྱས་ཏེ།
en: spread throughout an infinite number of universes,

source: ཚངས་པའི་འཇིག་རྟེན་གྱི་བར་དུ་མངོན་པར་འཕགས་ནས་ཉི་མ་དང་ཟླ་བའི་འོད་མོག་མོག་པོར་བྱས་ཏེ།
en: rising up to the abodes of Brahmā and eclipsing the light of the sun and the moon.

source: སླར་ལོག་ནས་བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་དབུའི་གཙུག་ཏུ་ནུབ་བོ། །
en: The light rays then came back toward the Blessed One and circumambulated him three times, before vanishing into the top of his head.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ལ་གཟར་ནས། པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ་ཞེ་ས་དང་བཅས་ཤིང་གུས་པ་དང་བཅས་པར་བཅོམ་ལྡན་འདས་གང་ན་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ་
en: At that moment, venerable Ānanda stood up, draped his shawl over one shoulder, knelt on his right knee, and bowed down respectfully and reverentially with his palms joined together in the direction of the Blessed One.

source: ཚིགས་སུ་བཅད་པ་མངོན་པར་བསྒྲུབ་པ་འདིས་བཅོམ་ལྡན་འདས་ལ་འཛུམ་པ་མཛད་པའི་དོན་ཞུས་པ།
en: With these verses, he then asked the Blessed One about the meaning of his smile:

source: བདེ་བར་གཤེགས་པ་ཅི་སླད་འཛུམ་སྟོན་པ། །ཟླ་བ་དྲི་མ་མེད་ཞལ་ཁྱོད་ལ་ཞུ། །
en: “Blissful One, why do you smile? I ask you whose face is stainless like the moon.

source: དྲི་མེད་གཟི་བརྗིད་མངའ་བ་ཁྱོད་ལ་ཞུ། །
en: I ask you who radiates pure majesty.

source: གསེར་གྱི་ཁ་དོག་ལྟ་བུ་ཁྱོད་ལ་ཞུ། །
en: I ask you who has the color of gold.

source: བདེ་བར་གཤེགས་པ་ཅི་སླད་འཛུམ་སྟོན་པ། །དམ་པའི་གཟུགས་རྣམས་མངའ་བ་ཁྱོད་ལ་ཞུ། །
en: “Blissful One, why do you smile? I ask you who has a sublime physical appearance.

source: འགྲོ་བ་རྣམས་ཀྱི་དོན་མཛད་ཁྱོད་ལ་ཞུ། །
en: I ask you who benefits beings.

source: ལྷ་དང་མི་རྣམས་ཀྱིས་མཆོད་ཁྱོད་ལ་ཞུ། །
en: I ask you who is worshiped by gods and men.

source: བདེ་བར་གཤེགས་པ་ཅི་སླད་འཛུམ་སྟོན་པ། །སྦྱིན་དང་དུལ་ལ་དགྱེས་པ་ཁྱོད་ལ་ཞུ། །
en: “Blissful One, why do you smile? I ask you who is delighted by generosity and control.

source: ཚུལ་ཁྲིམས་ཡོངས་དག་གྱུར་པ་ཁྱོད་ལ་ཞུ། །
en: I ask you who has pure discipline.

source: བཟོད་པའི་སྟོབས་དང་སྟོབས་སྩོལ་ཁྱོད་ལ་ཞུ། །
en: I ask you who possesses the power of patience and confers this power upon others.

source: བདེ་བར་གཤེགས་པ་ཅི་སླད་འཛུམ་སྟོན་པ། །བརྩོན་འགྲུས་སྟོབས་དང་མཐུ་མངའ་ཁྱོད་ལ་ཞུ། །
en: “Blissful One, why do you smile? I ask you who possesses the power and strength of diligence.

source: བསམ་གཏན་མངོན་ཤེས་དགྱེས་པ་ཁྱོད་ལ་ཞུ། །
en: I ask you who is delighted by concentration and higher perception.

source: ཤེས་རབ་ནམ་མཁའ་མཉམ་པ་ཁྱོད་ལ་ཞུ། །
en: I ask you whose insight is equal to space.

source: བདེ་བར་གཤེགས་པ་ཅི་སླད་འཛུམ་སྟོན་པ། །རྟག་ཏུ་བྱམས་པའི་ཐུགས་ཅན་ཁྱོད་ལ་ཞུ། །
en: “Blissful One, why do you smile? I ask you who always has a loving heart.

source: རྟག་ཏུ་ཐུགས་རྗེ་ལྡན་པ་ཁྱོད་ལ་ཞུ། །
en: I ask you who is always compassionate.

source: དགའ་དང་བཏང་སྙོམས་དགྱེས་པ་ཁྱོད་ལ་ཞུ། །
en: I ask you who is delighted by joy and equanimity.

source: བདེ་བར་གཤེགས་པ་ཅི་སླད་འཛུམ་སྟོན་པ། །སྲིད་པ་གསུམ་པོ་མཐར་འབྱིན་ཁྱོད་ལ་ཞུ། །
en: “Blissful One, why do you smile? I ask you who brings an end to the three realms.

source: སྤྱན་གསུམ་དྲི་མ་མི་མངའ་ཁྱོད་ལ་ཞུ། །
en: I ask you who possesses the three spotless eyes.

source: བདུད་རྩི་ཆོས་རྣམས་གསུང་བ་ཁྱོད་ལ་ཞུ། །
en: I ask you who teaches the ambrosia of the Dharma.

source: བདེ་བར་གཤེགས་པ་ཅི་སླད་འཛུམ་སྟོན་པ། །བདུད་རྣམས་ཐ་མར་འབྱིན་པ་ཁྱོད་ལ་ཞུ། །
en: “Blissful One, why do you smile? I ask you who eradicates demonic influences.

source: ངན་པའི་ཚོགས་རྣམས་འཇོམས་པ་ཁྱོད་ལ་ཞུ། །
en: I ask you who subdues the evil hordes.

source: བདེན་པ་དམ་པ་གཟིགས་པ་ཁྱོད་ལ་ཞུ། །
en: I ask you who sees the sacred truth.

source: བདེ་བར་གཤེགས་པ་ཅི་སླད་འཛུམ་སྟོན་པ། །སྟོབས་བཅུ་དམ་པ་མངའ་བ་ཁྱོད་ལ་ཞུ། །
en: “Blissful One, why do you smile? I ask you who possesses the ten sacred powers.

source: ཐེ་ཙོམ་དག་ནི་གཅོད་མཛད་ཁྱོད་ལ་ཞུ། །
en: I ask you who eliminates all doubts.

source: ཡོན་ཏན་སྟོང་གིས་བརྒྱན་པ་ཁྱོད་ལ་ཞུ། །
en: I ask you who is adorned with a thousand qualities.”

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: After venerable Ānanda had uttered those verses, the Blessed One asked him,

source: ཀུན་དགའ་བོ་ཁྱོད་ཀྱིས་མི་འམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོའི་སླས་རྣམས་ང་ལས་དགེ་བའི་རྩ་བ་བསྐྱེད་དོ། །
en: “Ānanda, did you see how the queens of the kiṃnara king Druma have generated roots of merit in relation to me?

source: བསམ་པ་ཐག་པ་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ནས། བུད་མེད་ཀྱི་དངོས་པོ་ལས་བསྒྱུར་ཞིང་སྐྱེས་པའི་དངོས་པོ་ཐོབ་པར་བྱ་བའི་ཕྱིར་ངའི་རྐང་པ་གཉིས་ལ་གཏུགས་པ་མཐོང་ངམ།
en: Did you see how they sincerely gave rise to the mind set on unsurpassed and perfect awakening, and how they prostrated to my feet in order to leave behind their female bodies and acquire male bodies?”

source: བཅོམ་ལྡན་འདས་མཐོང་ངོ་། །
en: “Yes, Blessed One, I saw this.”

source: ཀུན་དགའ་བོ་མི་འམ་ཅིའི་སླས་བརྒྱད་ཁྲི་བཞི་སྟོང་པོ་དེ་དག་གིས་བསམ་པ་ཐག་པ་ནས་དགེ་བའི་རྩ་བ་བསྐྲུན་པ་འདིས་འདི་ནི་ཤི་འཕོས་ནས་བུད་མེད་ཀྱི་དངོས་པོ་ལས་གྱུར་ཏེ་སྐྱེས་པའི་ལུས་ཐོབ་ནས་དགའ་ལྡན་གྱི་ལྷ་རྣམས་དང་སྐལ་བ་མཉམ་པར་སྐྱེ་བར་འགྱུར་རོ། །
en: “Ānanda, by sincerely creating those roots of virtue, these eighty-four thousand kiṃnara queens will, after they die, leave their female bodies behind, acquire male bodies, and be reborn with the general fortune of the gods of the Heaven of Joy.

source: དེར་སྐྱེས་ནས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པ་དང་ལྷན་ཅིག་ཏུ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་རྫོགས་པའི་བྱང་ཆུབ་འདི་ཀུན་འགྲོ་བ་བྱེད་པར་འགྱུར་རོ། །
en: Once they are born there, they will, together with the bodhisattva great being Maitreya, propagate the perfect awakening of the blessed buddhas.

source: བྱམས་པ་དེ་བཞིན་གཤེགས་པ་བྱང་ཆུབ་ཐོབ་པ་ན་མཉེས་པར་བྱེད་ཅིང་དམ་པའི་ཆོས་ཀྱང་ཀུན་བགྲོ་བ་བྱེད་པར་འགྱུར་རོ། །
en: When Maitreya achieves the awakening of a thus-gone one, they will serve him and propagate his sacred Dharma.

source: བསྐལ་པ་བཟང་པོའི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ལ་ཡང་རིམ་གྱིས་མཉེས་པར་བྱེད་པར་འགྱུར། དེ་དག་གིས་དམ་པའི་ཆོས་ཀྱང་ཀུན་བགྲོ་བ་བྱེད་པར་འགྱུར། འཛིན་པར་འགྱུར་རོ། །
en: Then, one after the other, they will serve all the thus-gone ones of this excellent eon and propagate and uphold their sacred Dharma.

source: དེ་དག་རིམ་གྱིས་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་ཡང་དག་པར་བསྒྲུབ་པར་བྱ་བ་ཐམས་ཅད་ཀུན་ཏུ་རྫོགས་པར་བྱས་ནས།
en: They will gradually perfect all the factors of awakening that are to be accomplished.

source: གང་གི་ཚེ་མི་འམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་བ་དེའི་ཚེ་དེ་དག་སངས་རྒྱས་ཀྱི་ཞིང་དེར་སྐྱེ་བར་འགྱུར་ཏེ
en: Then, when the kiṃnara king Druma awakens to unsurpassed and perfect buddhahood, they will be reborn in his buddha realm, and

source: དེས་དེ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་སྟོན་པར་ཡང་འགྱུར་རོ། །
en: he will prophesy their unsurpassed and perfect awakening.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་མི་འམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Then, the kiṃnara king Druma said,

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པས་བདག་ཅག་ལ་སངས་རྒྱས་ཀྱི་མཛད་པ་མཛད་དོ། །
en: “Blessed One, Thus-Gone One, you have performed the deeds of a buddha for us.

source: ངན་སོང་ངན་འགྲོ་ཐམས་ཅད་ཀྱི་ལམ་བཀུམ་མོ། །བདེ་འགྲོ་ཐམས་ཅད་ཀྱི་ལམ་རྣམ་པར་སྦྱངས་སོ། །
en: You have closed all the paths leading to the lower realms and cleared all the paths leading to the happy destinies.

source: བདག་ཅག་བྱང་ཆུབ་ཀྱི་ལམ་ལ་རབ་ཏུ་བཀོད་དོ། །
en: You have placed us on the path to awakening.

source: བདག་ཅག་ལ་ཆོས་ཀྱི་གཏེར་བསྟན་ཏོ། །
en: You have revealed to us the treasure of the Dharma.

source: བདག་ཅག་ཡེ་ཤེས་ཀྱིས་ལ་བཀོད་དོ། །
en: You have established us at the level of wisdom.

source: དགེ་བའི་རྩ་བ་ཐམས་ཅད་འབར་བར་བགྱིས་སོ། །
en: You have caused all our roots of virtue to blaze forth.

source: ཕ་རོལ་ཏུ་ཕྱིན་པའི་ཕྱོགས་བསྟན་ཏོ། །
en: You have taught us the different aspects of the perfections.

source: ཐབས་ལ་མཁས་པ་བསྟན་ཏོ། །
en: You have taught us skillful means.

source: བདག་ཅག་བྱང་ཆུབ་ཀྱི་སེམས་ཡང་དག་པར་འཛིན་པ་སྩལ་ཏོ། །
en: You have granted us the opportunity to embrace the mind set on awakening.

source: ཆོས་བསྒྲགས་པས་རབ་ཏུ་དགའ་བར་མཛད་དོ། །
en: You have generated joy in us by proclaiming the Dharma.

source: དགའ་བ་དང་དང་བ་དང་། མཆོག་ཏུ་དགའ་བ་ཐོབ་པས་གཟེངས་བསྟོད་དོ། །
en: You have encouraged us to develop joy, faith, and delight.

source: ཆོས་ཟབ་མོའི་བཟོད་པ་ལ་རབ་ཏུ་དགའ་བར་མཛད་དོ། །
en: You have inspired us to rejoice in the acceptance of the profound Dharma.

source: བདག་ཅག་ཕྱིར་མི་ལྡོག་པའི་ས་ལ་རབ་ཏུ་བཀོད་དོ། །
en: You have established us on the level of irreversibility.

source: བདག་ཅག་ནི་བཅོམ་ལྡན་འདས་ལ་བྱས་པ་གཟོ་བ་ལགས་ཀྱི་བྱས་པ་མི་གཟོ་བ་མ་ལགས་ཀྱང་བཅོམ་ལྡན་འདས་བདག་ཅག་གིས་ཤ་དང་ཁྲག་གིས་ཀྱང་དེ་བཞིན་གཤེགས་པ་ལ་ལན་མི་ལོན་ན་གཞན་གྱིས་ལན་ལྡོན་པར་མི་འགྱུར་བ་ལྟ་སྨོས་ཀྱང་ཅི་འཚལ།
en: We will always remember the kindness of the Blessed One; we will never forget it! Blessed One, even with our own flesh and blood, let alone anything else, we would never be able to repay the the Thus-Gone One’s kindness.”

source: དེ་ནས་འཁོར་དེའི་ནང་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཁ་ཅིག་འདི་སྙམ་དུ་སེམས་ཏེ།
en: At that moment, some bodhisattvas present in the assembly wondered,

source: མ་ལ་མིའམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོ་འདི་ཇི་སྲིད་ཅིག་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར།
en: “How long will it take the kiṃnara king Druma to awaken to unsurpassed and perfect buddhahood?

source: འདིའི་མིང་ནི་ཇི་སྐད་ཅེས་བྱ་བར་འགྱུར།
en: What will his name be?

source: བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་ནི་ཇི་སྙེད་ཅིག་ཏུ་འགྱུར།
en: How large will his saṅgha of bodhisattvas be?

source: ལོངས་སྤྱོད་དང་ཡོངས་སུ་སྤྱོད་པ་ནི་ཇི་འདྲ་ཞིག་ཏུ་འགྱུར།
en: What will his wealth and possessions be like?

source: དེའི་སེམས་ཅན་བཀོད་པ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་ནི་ཇི་འདྲ་བ་ཞིག་ཏུ་འགྱུར་སྙམ་མོ། །
en: What will his array of beings and the array of qualities of his buddha realm be like?”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གི་སེམས་ཀྱི་རྣམ་པར་རྟོག་པ་ཐུགས་ཀྱིས་ཡོངས་སུ་མཁྱེན་ནས་འཛུམ་པ་མཛད་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱི་ཞལ་གྱི་སྒོ་ནས་འོད་ཟེར་དུ་མ་ཁ་དོག་ཐ་དད་པ་ཁ་དོག་བརྒྱ་སྟོང་ཕྲག་དུ་མ་བྱུང་སྟེ
en: Knowing the thoughts of those bodhisattvas, the Blessed One smiled and many hundreds of thousands of multicolored light rays radiated from his mouth,

source: ཕྱོགས་བཅུ་ཀུན་གྱི་ཕྱོགས་རེ་རེར་ཡང་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་སྣང་བར་བྱས་ཏེ།
en: illuminating as many buddha realms in each of the ten directions as there are grains of sand in the Ganges.

source: སེམས་ཅན་རྣམས་ཀྱི་ངན་སོང་གི་སྡུག་བསྔལ་ཐམས་ཅད་ཞི་བར་བྱས་ནས་ལྷ་དང་མི་དང་ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་འདུན་པར་བྱས་ཏེ་
en: Those light rays allayed all the suffering of all the beings in the lower realms and inspired the world with its gods, humans, and demigods.

source: སླར་ལོག་ནས་བཅོམ་ལྡན་འདས་ལ་ལན་སྟོང་དུ་བསྐོར་བ་བྱས་ཏེབཅོམ་ལྡན་འདས་ཀྱི་དབུའི་གཙུག་ཏུ་ནུབ་བོ། །
en: The light rays then came back toward to the Blessed One and circumambulated him a thousand times, before vanishing into the top of his head.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་བཅོམ་ལྡན་འདས་ཀྱིས་སྔོན་ཆད་མ་མཛད་པའི་འཛུམ་པ་མཐོང་ནས་སྟན་ལས་ལངས་ཏེ་ཐལ་མོ་སྦྱར་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་ཕྱག་འཚལ་ཏེ
en: When he saw that smile of the Blessed One, which he had never seen before, venerable Ānanda stood up, joined his palms together, and prostrated to the Blessed One’s feet.

source: ལན་གསུམ་བསྐོར་བ་བྱས་ནས། བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འདུག་སྟེ་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ནས།
en: He circumambulated him three times and knelt on his right knee in front of him.

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ། བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་པས་གསོལ་པ།
en: Then, bowing down with his palms joined together in the direction of the Blessed One, he uttered these verses:

source: བདེ་བར་གཤེགས་ཀྱི་འཛུམ་པ་ཅི་འདྲ་བ། །དེ་རིང་ཕྱུང་སྟེ་ཐུག་མེད་བྱེ་བའི་ཞིང་། །རྒྱ་ཆེན་ཕྱོགས་བཅུའི་གང་གཱའི་རྡུལ་མཐའ་ཡས། །ཁྱབ་པ་དེ་འདྲ་སྔོན་ཆད་ཡོང་མ་མཐོང་། །
en: “The radiance of the Blissful One’s smile, which we have witnessed today, Has spread throughout countless millions of vast buddha realms in the ten directions, As numerous as the countless grains of sand in the Ganges; I have never seen such a smile before!

source: ཚངས་པ་དེ་བཞིན་འཇིག་རྟེན་སྐྱོང་བ་དང་། །ནོར་བུ་མེ་དང་ཉི་མ་ཟླ་བའི་འོད། །མི་དབང་གཟི་བརྗིད་ཀྱིས་ནི་མོག་མོག་གྱུར། །
en: “The radiance of the Lord of Humans Has eclipsed the brilliance of Brahmā, the protectors of the world, Gems, fire, the sun, and the moon.

source: འཛུམ་མཛད་འདི་ཡི་རྒྱུ་ནི་ལུང་བསྟན་གསོལ། །
en: Please explain to us the reason behind this smile!

source: སུ་ཡི་ཆེད་དུ་དཔའ་བོ་ཁྱོད་ཀྱིས་འོད་ཕྱུང་བས། །འདིར་ནི་ངན་སོང་གསུམ་ཞི་བྱང་ཆུབ་ཡན་ལག་རྫོགས། །
en: “Great hero, for whom did you emit this light That pacifies the three lower realms and perfects the branches of awakening?

source: ཆོས་ཀྱི་རྗེ་ཡིས་བདག་ཅག་རྣམས་ཀྱི་དོགས་པ་སོལ། །
en: Dharma Lord, please eliminate our doubts!

source: མི་རྣམས་ཀྱི་ནི་ཡིད་གཉིས་མ་ལུས་ལེགས་པར་ཁུམ། །
en: Please remove all our uncertainty!

source: འཁོར་ཀུན་དགའ་བས་རྟོག་བགྱིད་ན། །སུ་སླད་དེ་རིང་འཛུམ་པ་བསྟན། །
en: “As the entire assembly joyfully reflects on this, For whom did you smile today?”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་མངོན་པར་བསྟོད་ནས་བསྐོར་བ་བྱས་ཏེ་རང་གི་སྟན་ལ་འདུག་གོ། །
en: After he had offered those verses of praise to the Blessed One, venerable Ānanda circumambulated him and sat down at his seat.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་ཚེ་གླང་པོ་ཆེའི་ལྟ་སྟངས་ཀྱིས་ཕྱོགས་བཅུར་གཟིགས་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: The Blessed One surveyed the ten directions with his elephant’s gaze and then said to venerable Ānanda,

source: ཀུན་དགའ་བོ་ཁྱོད་ཀྱིས་མི་འམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོ་འདིས་ཚུལ་འདི་ལྟ་བུ་དང་། རྒྱ་ཆེ་བ་འདི་ལྟ་བུ་དང་། རྣམ་པ་འདི་ལྟ་བུ་འདིས་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པ་བྱས་པ་མཐོང་ངམ།
en: “Ānanda, did you see the manner, the greatness, and the way in which the kiṃnara king Druma worshiped the Thus-Gone One?”

source: བཅོམ་ལྡན་འདས་མཐོང་ལགས་སོ། །
en: “Yes, Blessed One, I saw it.

source: བདེ་བར་གཤེགས་པ་མཐོང་ལགས་སོ། །
en: Blissful One, I saw it.”

source: ཀུན་དགའ་བོ་མི་འམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོ་འདི་བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དྲུག་ཅུ་རྩ་བརྒྱད་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་སྟེ
en: “Ānanda, the kiṃnara king Druma will awaken to unsurpassed and perfect buddhahood after sixty-eight billion eons,
